<script setup lang="ts">
import { ref } from 'vue'

const moreInfo = ref<number>(0)

function expandAboutInfo() {
  if (moreInfo.value == 0) {
    const info = document.querySelector('#more-info-main') as HTMLElement
    if (info) {
      moreInfo.value = info.scrollHeight
    }
  } else {
    moreInfo.value = 0
  }
}
</script>

<template>
  <section>
    <div id="project">
      <h2>О проекте</h2>
      <br />
      <br />
      <p class="mobile-center"><b>Генеалогия Амшенских Армян</b></p>
      <p>
        Большинство людей не имеют фамильного древа и не обладают информацией о происхождении рода.
        Согласно статистике, 90% людей с трудом вспоминают имена своих прабабушек и прадедушек.
      </p>
      <p>
        Древние знали своих предков до седьмого колена, потому что, по старым верованиям, на судьбу
        человека оказывают влияние семь поколений. Отсюда и берет свое происхождение слово «Семья»,
        состоящее из двух составляющих: «Семь» и «Я». Важность традиции составления фамильного древа
        также берет свое начало из древних времен.
      </p>
      <p>
        Родовое или фамильное древо - это память рода, где ствол древа символизирует нас самих,
        листья это наши дети, а корни – наши предки.
      </p>
      <p>
        <b>Цель нашего проекта</b> - помочь старшему поколению <b>передать</b> своим детям и внукам
        <b>максимально достоверную историю семьи</b>. Человек, который знает историю своего рода, не
        оглядывается назад в поисках точки опоры, а идёт только вперёд.
      </p>
      <span id="more-info-main" :style="{ height: `${moreInfo}px` }">
        <p>
          Единственным документальным источником досоветского периода, содержащем информацию об
          амшенцах Российской империи, являются метрические книги армянских церквей, в которых
          записана информация о крещении, венчании и смерти каждого прихожанина.
        </p>
        <p>
          Проект <b>ГенАмшен</b> занимается поиском метрических книг в архивах Абхазии, Армении,
          Израиля и России для того, чтобы создать самую полную, глобальную и открытую базу данных.
        </p>
        <p>Для создания такой базы данных о наших предках необходимо:</p>
        <ul class="text">
          <li class="text">сделать цифровые копии всех книг, известных на данный момент</li>
          <li class="text">расшифровать рукописный армянский текст</li>
          <li class="text">перевести этот текст на русский язык</li>
          <li class="text">
            предоставить свободный доступ к данным книгам через интернет с удобным поиском по личным
            данным
          </li>
          <li class="text">
            открыть раздел на сайте для оказания помощи в составлении родового древа
          </li>
        </ul>
        <p>
          На сегодняшний день обнаруженно <b>15 книг</b>, в сумме около 3551 листов рукописей
          армянских церквей Абхазии, <b>за период с 1890 по 1919 годы</b>.
        </p>
        <p>
          Приглашаем всех, кто может помочь нам в поиске метрических книг и любых епархиальных
          документов или переписки, касающейся амшенских армян, присоедениться к нашей команде.
        </p>
        <p>
          Всё, о чём говорилось выше, составляет только первый этап нашего проекта. Следующие два
          этапа будут ещё более интересными и познавательными.
          <b>Многие из загадок вашей родословной будут разгаданы</b>, а некоторые новые могут
          появиться.
        </p>
        <p>
          Если вы поддерживаете этот проект и считаете важным его значение для каждой семьи,
          пожалуйста, покажите это подпиской на нашем сайте, чтобы наша команда работала с ещё
          большим энтузиазмом и полной отдачей для всех нас.
        </p></span
      >
      <br />
      <br />
      <div class="read-more">
        <button @click="expandAboutInfo()" id="myBtnRead">
          {{ moreInfo == 0 ? 'Развернуть' : 'Свернуть' }}
        </button>
      </div>
    </div>
  </section>
</template>

<style scoped>
@import '@/assets/styles/style.css';

#more-info-main {
  height: 0;
  overflow: hidden;
  transition: height 0.5s;
}
</style>
